FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
/**
 ******************************************************************************
 * @file    stm32l1xx_rtc.c
 * @author  MCD Application Team
 * @version V1.1.1
 * @date    05-March-2012
 * @brief   This file provides firmware functions to manage the following
 *          functionalities of the Real-Time Clock (RTC) peripheral:
 *           + Initialization
 *           + Calendar (Time and Date) configuration
 *           + Alarms (Alarm A and Alarm B) configuration
 *           + WakeUp Timer configuration
 *           + Daylight Saving configuration
 *           + Output pin Configuration
 *           + Coarse digital Calibration configuration
 *           + Smooth digital Calibration configuration
 *           + TimeStamp configuration
 *           + Tampers configuration
 *           + Backup Data Registers configuration
 *           + Output Type Config configuration
 *           + Shift control synchronisation
 *           + Interrupts and flags management
 *
 * @verbatim
 *
 * ===============================================================================
 ##### RTC Domain Reset #####
 #####===============================================================================
 #####[..] After power-on reset, the RTC domain (RTC clock source configuration,
 #####   RTC registers and RTC Backup data registers) is reset. You can also
 #####   reset this domain by software using the RCC_RTCResetCmd() function.
 #####
 ##### RTC Operating Condition #####
 #####===============================================================================
 #####[..] As long as the supply voltage remains in the operating range,
 #####   the RTC never stops, regardless of the device status (Run mode,
 #####   low power modes or under reset).
 #####
 ##### RTC Domain Access #####
 #####===============================================================================
 #####[..] After reset, the RTC domain (RTC clock source configuration,
 #####   RTC registers and RTC Backup data registers) are protected against
 #####   possible stray write accesses.
 #####[..] To enable access to the RTC Domain and RTC registers, proceed as follows:
 #####   (+) Enable the Power Controller (PWR) APB1 interface clock using the
 #####       RCC_APB1PeriphClockCmd() function.
 #####   (+) Enable access to RTC domain using the PWR_RTCAccessCmd() function.
 #####   (+) Select the RTC clock source using the RCC_RTCCLKConfig() function.
 #####   (+) Enable RTC Clock using the RCC_RTCCLKCmd() function.
 #####
 ##### How to use this driver #####
 #####===============================================================================
 #####[..]
 #####  (+) Enable the RTC domain access (see description in the section above)
 #####  (+) Configure the RTC Prescaler (Asynchronous and Synchronous) and
 #####      RTC hour format using the RTC_Init() function.
 ***Time and Date configuration ***
 #####==================================
 #####[..]
 #####  (+) To configure the RTC Calendar (Time and Date) use the RTC_SetTime()
 #####      and RTC_SetDate() functions.
 #####  (+) To read the RTC Calendar, use the RTC_GetTime() and RTC_GetDate()
 #####      functions.
 #####  (+) To read the RTC subsecond, use the RTC_GetSubSecond() function.
 #####  (+) Use the RTC_DayLightSavingConfig() function to add or sub one
 #####      hour to the RTC Calendar.
 #####
 ***Alarm configuration ***
 #####==========================
 #####[..]
 #####  (+) To configure the RTC Alarm use the RTC_SetAlarm() function.
 #####  (+) Enable the selected RTC Alarm using the RTC_AlarmCmd() function
 #####  (+) To read the RTC Alarm, use the RTC_GetAlarm() function.
 #####  (+) To read the RTC alarm SubSecond, use the RTC_GetAlarmSubSecond() function.
 #####
 ***RTC Wakeup configuration ***
 #####===============================
 #####[..]
 #####  (+) Configure the RTC Wakeup Clock source use the RTC_WakeUpClockConfig()
 #####      function.
 #####  (+) Configure the RTC WakeUp Counter using the RTC_SetWakeUpCounter()
 #####      function.
 #####  (+) Enable the RTC WakeUp using the RTC_WakeUpCmd() function
 #####  (+) To read the RTC WakeUp Counter register, use the RTC_GetWakeUpCounter()
 #####      function.
 #####
 ***Outputs configuration ***
 #####============================
 #####[..] The RTC has 2 different outputs:
 #####  (+) AFO_ALARM: this output is used to manage the RTC Alarm A, Alarm B
 #####      and WaKeUp signals.
 #####      To output the selected RTC signal on RTC_AF1 pin, use the
 #####      RTC_OutputConfig() function.
 #####  (+) AFO_CALIB: this output is 512Hz signal or 1Hz.
 #####      To output the RTC Clock on RTC_AF1 pin, use the RTC_CalibOutputCmd()
 #####      function.
 #####
 ***Smooth digital Calibration configuration ***
 #####===============================================
 #####[..]
 #####  (+) Configure the RTC Original Digital Calibration Value and the corresponding
 #####      calibration cycle period (32s,16s and 8s) using the RTC_SmoothCalibConfig()
 #####      function.
 #####
 ***Coarse digital Calibration configuration ***
 #####===============================================
 #####[..]
 #####  (+) Configure the RTC Coarse Calibration Value and the corresponding
 #####      sign using the RTC_CoarseCalibConfig() function.
 #####  (+) Enable the RTC Coarse Calibration using the RTC_CoarseCalibCmd()
 #####      function.
 #####
 ***TimeStamp configuration ***
 #####==============================
 #####[..]
 #####  (+) Configure the RTC_AF1 trigger and enables the RTC TimeStamp
 #####      using the RTC_TimeStampCmd() function.
 #####  (+) To read the RTC TimeStamp Time and Date register, use the
 #####      RTC_GetTimeStamp() function.
 #####  (+) To read the RTC TimeStamp SubSecond register, use the
 #####      RTC_GetTimeStampSubSecond() function.
 #####
 ***Tamper configuration ***
 #####===========================
 #####[..]
 #####  (+) Configure the Tamper filter count using RTC_TamperFilterConfig()
 #####      function.
 #####  (+) Configure the RTC Tamper trigger Edge or Level according to the Tamper
 #####      filter (if equal to 0 Edge else Level) value using the RTC_TamperConfig()
 #####      function.
 #####  (+) Configure the Tamper sampling frequency using RTC_TamperSamplingFreqConfig()
 #####      function.
 #####  (+) Configure the Tamper precharge or discharge duration using
 #####      RTC_TamperPinsPrechargeDuration() function.
 #####  (+) Enable the Tamper Pull-UP using RTC_TamperPullUpDisableCmd() function.
 #####  (+) Enable the RTC Tamper using the RTC_TamperCmd() function.
 #####  (+) Enable the Time stamp on Tamper detection event using
 #####      RTC_TSOnTamperDetecCmd() function.
 #####
 ***Backup Data Registers configuration ***
 #####==========================================
 #####[..]
 #####  (+) To write to the RTC Backup Data registers, use the RTC_WriteBackupRegister()
 #####      function.
 #####  (+) To read the RTC Backup Data registers, use the RTC_ReadBackupRegister()
 #####      function.
 #####
 ##### RTC and low power modes #####
 #####===============================================================================
 #####[..] The MCU can be woken up from a low power mode by an RTC alternate
 #####   function.
 #####[..] The RTC alternate functions are the RTC alarms (Alarm A and Alarm B),
 #####   RTC wakeup, RTC tamper event detection and RTC time stamp event detection.
 #####   These RTC alternate functions can wake up the system from the Stop
 #####   and Standby lowpower modes.
 #####   The system can also wake up from low power modes without depending
 #####   on an external interrupt (Auto-wakeup mode), by using the RTC alarm
 #####   or the RTC wakeup events.
 #####[..] The RTC provides a programmable time base for waking up from the
 #####   Stop or Standby mode at regular intervals.
 #####   Wakeup from STOP and Standby modes is possible only when the RTC
 #####   clock source is LSE or LSI.
 #####
 ##### Selection of RTC_AF1 alternate functions #####
 #####===============================================================================
 #####[..] The RTC_AF1 pin (PC13) can be used for the following purposes:
 #####   (+) Wakeup pin 2 (WKUP2) using the PWR_WakeUpPinCmd() function.
 #####   (+) AFO_ALARM output.
 #####   (+) AFO_CALIB output.
 #####   (+) AFI_TAMPER.
 #####   (+) AFI_TIMESTAMP.
 #####
 +------------------------------------------------------------------------------------------+
 |     Pin         |AFO_ALARM |AFO_CALIB |AFI_TAMPER |AFI_TIMESTAMP | WKUP2  |ALARMOUTTYPE  |
 |  configuration  | ENABLED  | ENABLED  |  ENABLED  |   ENABLED    |ENABLED |  AFO_ALARM   |
 |  and function   |          |          |           |              |        |Configuration |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |   Alarm out     |          |          |           |              | Don't  |              |
 |   output OD     |     1    |    0     |Don't care | Don't care   | care   |      0       |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |   Alarm out     |          |          |           |              | Don't  |              |
 |   output PP     |     1    |    0     |Don't care | Don't care   | care   |      1       |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 | Calibration out |          |          |           |              | Don't  |              |
 |   output PP     |     0    |    1     |Don't care | Don't care   | care   |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  TAMPER input   |          |          |           |              | Don't  |              |
 |   floating      |     0    |    0     |     1     |      0       | care   |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  TIMESTAMP and  |          |          |           |              | Don't  |              |
 |  TAMPER input   |     0    |    0     |     1     |      1       | care   |  Don't care  |
 |   floating      |          |          |           |              |        |              |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 | TIMESTAMP input |          |          |           |              | Don't  |              |
 |    floating     |     0    |    0     |     0     |      1       | care   |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  Wakeup Pin 2   |     0    |    0     |     0     |      0       |   1    |  Don't care  |
 |-----------------|----------|----------|-----------|--------------|--------|--------------|
 |  Standard GPIO  |     0    |    0     |     0     |      0       |   0    |  Don't care  |
 +------------------------------------------------------------------------------------------+
 |
 | @endverbatim
 |
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_rtc.h"
#include "stm32l1xx_rcc.h"

/** @addtogroup STM32L1xx_StdPeriph_Driver
 * @{
 */

/** @defgroup RTC
 * @brief RTC driver modules
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

