FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
/* Masks Definition */
#define RTC_TR_RESERVED_MASK    ( ( uint32_t ) 0x007F7F7F )
#define RTC_DR_RESERVED_MASK    ( ( uint32_t ) 0x00FFFF3F )
#define RTC_INIT_MASK           ( ( uint32_t ) 0xFFFFFFFF )
#define RTC_RSF_MASK            ( ( uint32_t ) 0xFFFFFF5F )
#define RTC_FLAGS_MASK                                                      \
    ( ( uint32_t ) ( RTC_FLAG_TSOVF | RTC_FLAG_TSF | RTC_FLAG_WUTF |        \
                     RTC_FLAG_ALRBF | RTC_FLAG_ALRAF | RTC_FLAG_INITF |     \
                     RTC_FLAG_RSF | RTC_FLAG_INITS | RTC_FLAG_WUTWF |       \
                     RTC_FLAG_ALRBWF | RTC_FLAG_ALRAWF | RTC_FLAG_TAMP1F |  \
                     RTC_FLAG_TAMP2F | RTC_FLAG_TAMP3F | RTC_FLAG_RECALPF | \
                     RTC_FLAG_SHPF ) )

#define INITMODE_TIMEOUT        ( ( uint32_t ) 0x00002000 )
#define SYNCHRO_TIMEOUT         ( ( uint32_t ) 0x00008000 )
#define RECALPF_TIMEOUT         ( ( uint32_t ) 0x00001000 )
#define SHPF_TIMEOUT            ( ( uint32_t ) 0x00002000 )

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static uint8_t RTC_ByteToBcd2( uint8_t Value );
static uint8_t RTC_Bcd2ToByte( uint8_t Value );

/* Private functions ---------------------------------------------------------*/

/** @defgroup RTC_Private_Functions
 * @{
 */

/** @defgroup RTC_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Initialization and Configuration functions #####
 #####===============================================================================
 #####[..] This section provide functions allowing to initialize and configure the
 #####   RTC Prescaler (Synchronous and Asynchronous), RTC Hour format, disable
 #####   RTC registers Write protection, enter and exit the RTC initialization mode,
 #####   RTC registers synchronization check and reference clock detection enable.
 #####   (#) The RTC Prescaler is programmed to generate the RTC 1Hz time base.
 #####       It is split into 2 programmable prescalers to minimize power consumption.
 #####       (++) A 7-bit asynchronous prescaler and A 13-bit synchronous prescaler.
 #####       (++) When both prescalers are used, it is recommended to configure the
 #####           asynchronous prescaler to a high value to minimize consumption.
 #####   (#) All RTC registers are Write protected. Writing to the RTC registers
 #####       is enabled by writing a key into the Write Protection register, RTC_WPR.
 #####   (#) To Configure the RTC Calendar, user application should enter
 #####       initialization mode. In this mode, the calendar counter is stopped
 #####       and its value can be updated. When the initialization sequence is
 #####       complete, the calendar restarts counting after 4 RTCCLK cycles.
 #####   (#) To read the calendar through the shadow registers after Calendar
 #####       initialization, calendar update or after wakeup from low power modes
 #####       the software must first clear the RSF flag. The software must then
 #####       wait until it is set again before reading the calendar, which means
 #####       that the calendar registers have been correctly copied into the
 #####       RTC_TR and RTC_DR shadow registers.The RTC_WaitForSynchro() function
 #####       implements the above software sequence (RSF clear and RSF check).
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Deinitializes the RTC registers to their default reset values.
 * @note   This function doesn't reset the RTC Clock source and RTC Backup Data
 *         registers.
 * @param  None
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC registers are deinitialized
 *          - ERROR: RTC registers are not deinitialized
 */
ErrorStatus RTC_DeInit( void )
{
    __IO uint32_t wutcounter = 0x00;
    uint32_t wutwfstatus = 0x00;
    ErrorStatus status = ERROR;

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Set Initialization mode */
    if( RTC_EnterInitMode() == ERROR )
    {
        status = ERROR;
    }
    else
    {
        /* Reset TR, DR and CR registers */
        RTC->TR = ( uint32_t ) 0x00000000;
        RTC->DR = ( uint32_t ) 0x00002101;

        /* Reset All CR bits except CR[2:0] */
        RTC->CR &= ( uint32_t ) 0x00000007;

        /* Wait till RTC WUTWF flag is set and if Time out is reached exit */
        do
        {
            wutwfstatus = RTC->ISR & RTC_ISR_WUTWF;
            wutcounter++;
        } while( ( wutcounter != INITMODE_TIMEOUT ) && ( wutwfstatus == 0x00 ) );

        if( ( RTC->ISR & RTC_ISR_WUTWF ) == RESET )
        {
            status = ERROR;
        }
        else
        {
            /* Reset all RTC CR register bits */
            RTC->CR &= ( uint32_t ) 0x00000000;
            RTC->WUTR = ( uint32_t ) 0x0000FFFF;
            RTC->PRER = ( uint32_t ) 0x007F00FF;
            RTC->CALIBR = ( uint32_t ) 0x00000000;
            RTC->ALRMAR = ( uint32_t ) 0x00000000;
            RTC->ALRMBR = ( uint32_t ) 0x00000000;
            RTC->SHIFTR = ( uint32_t ) 0x00000000;
            RTC->CALR = ( uint32_t ) 0x00000000;
            RTC->ALRMASSR = ( uint32_t ) 0x00000000;
            RTC->ALRMBSSR = ( uint32_t ) 0x00000000;

            /* Reset ISR register and exit initialization mode */
            RTC->ISR = ( uint32_t ) 0x00000000;

            /* Reset Tamper and alternate functions configuration register */
            RTC->TAFCR = 0x00000000;

            /* Wait till the RTC RSF flag is set */
            if( RTC_WaitForSynchro() == ERROR )
            {
                status = ERROR;
            }
            else
            {
                status = SUCCESS;
            }
        }
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

