FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    if( ( RTC->ISR & RTC_ISR_RSF ) != RESET )
    {
        status = SUCCESS;
    }
    else
    {
        status = ERROR;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

    return( status );
}

/**
 * @brief  Enables or disables the RTC reference clock detection.
 * @param  NewState: new state of the RTC reference clock.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC reference clock detection is enabled
 *          - ERROR: RTC reference clock detection is disabled
 */
ErrorStatus RTC_RefClockCmd( FunctionalState NewState )
{
    ErrorStatus status = ERROR;

    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Set Initialization mode */
    if( RTC_EnterInitMode() == ERROR )
    {
        status = ERROR;
    }
    else
    {
        if( NewState != DISABLE )
        {
            /* Enable the RTC reference clock detection */
            RTC->CR |= RTC_CR_REFCKON;
        }
        else
        {
            /* Disable the RTC reference clock detection */
            RTC->CR &= ~RTC_CR_REFCKON;
        }

        /* Exit Initialization mode */
        RTC_ExitInitMode();

        status = SUCCESS;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

    return status;
}

/**
 * @brief  Enables or Disables the Bypass Shadow feature.
 * @note   When the Bypass Shadow is enabled the calendar value are taken
 *         directly from the Calendar counter.
 * @param  NewState: new state of the Bypass Shadow feature.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_BypassShadowCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    if( NewState != DISABLE )
    {
        /* Set the BYPSHAD bit */
        RTC->CR |= ( uint8_t ) RTC_CR_BYPSHAD;
    }
    else
    {
        /* Reset the BYPSHAD bit */
        RTC->CR &= ( uint8_t ) ~RTC_CR_BYPSHAD;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;
}

/**
 * @}
 */

/** @defgroup RTC_Group2 Time and Date configuration functions
 *  @brief   Time and Date configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Time and Date configuration functions #####
 #####===============================================================================
 #####[..] This section provide functions allowing to program and read the RTC
 #####   Calendar (Time and Date).
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Set the RTC current time.
 * @param  RTC_Format: specifies the format of the entered parameters.
 *   This parameter can be  one of the following values:
 *     @arg RTC_Format_BIN:  Binary data format.
 *     @arg RTC_Format_BCD:  BCD data format.
 * @param  RTC_TimeStruct: pointer to a RTC_TimeTypeDef structure that contains
 *                        the time configuration information for the RTC.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC Time register is configured
 *          - ERROR: RTC Time register is not configured
 */
ErrorStatus RTC_SetTime( uint32_t RTC_Format,
                         RTC_TimeTypeDef * RTC_TimeStruct )
{
    uint32_t tmpreg = 0;
    ErrorStatus status = ERROR;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );

    if( RTC_Format == RTC_Format_BIN )
    {
        if( ( RTC->CR & RTC_CR_FMT ) != ( uint32_t ) RESET )
        {
            assert_param( IS_RTC_HOUR12( RTC_TimeStruct->RTC_Hours ) );
            assert_param( IS_RTC_H12( RTC_TimeStruct->RTC_H12 ) );
        }
        else
        {
            RTC_TimeStruct->RTC_H12 = 0x00;
            assert_param( IS_RTC_HOUR24( RTC_TimeStruct->RTC_Hours ) );
        }

        assert_param( IS_RTC_MINUTES( RTC_TimeStruct->RTC_Minutes ) );
        assert_param( IS_RTC_SECONDS( RTC_TimeStruct->RTC_Seconds ) );
    }
    else
    {
        if( ( RTC->CR & RTC_CR_FMT ) != ( uint32_t ) RESET )
        {
            tmpreg = RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Hours );
            assert_param( IS_RTC_HOUR12( tmpreg ) );
            assert_param( IS_RTC_H12( RTC_TimeStruct->RTC_H12 ) );
        }
        else
        {
            RTC_TimeStruct->RTC_H12 = 0x00;
            assert_param( IS_RTC_HOUR24( RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Hours ) ) );
        }

        assert_param( IS_RTC_MINUTES( RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Minutes ) ) );
        assert_param( IS_RTC_SECONDS( RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Seconds ) ) );
    }

    /* Check the input parameters format */
    if( RTC_Format != RTC_Format_BIN )
    {
        tmpreg = ( ( ( uint32_t ) ( RTC_TimeStruct->RTC_Hours ) << 16 ) |  \
                   ( ( uint32_t ) ( RTC_TimeStruct->RTC_Minutes ) << 8 ) | \
                   ( ( uint32_t ) RTC_TimeStruct->RTC_Seconds ) |          \
                   ( ( uint32_t ) ( RTC_TimeStruct->RTC_H12 ) << 16 ) );
    }
    else
    {
        tmpreg = ( uint32_t ) ( ( ( uint32_t ) RTC_ByteToBcd2( RTC_TimeStruct->RTC_Hours ) << 16 ) |  \
                                ( ( uint32_t ) RTC_ByteToBcd2( RTC_TimeStruct->RTC_Minutes ) << 8 ) | \
                                ( ( uint32_t ) RTC_ByteToBcd2( RTC_TimeStruct->RTC_Seconds ) ) |      \
                                ( ( ( uint32_t ) RTC_TimeStruct->RTC_H12 ) << 16 ) );
    }

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Set Initialization mode */
    if( RTC_EnterInitMode() == ERROR )
    {
        status = ERROR;
    }
    else
    {
        /* Set the RTC_TR register */
        RTC->TR = ( uint32_t ) ( tmpreg & RTC_TR_RESERVED_MASK );

        /* Exit Initialization mode */
        RTC_ExitInitMode();

        /* If  RTC_CR_BYPSHAD bit = 0, wait for synchro else this check is not needed */
        if( ( RTC->CR & RTC_CR_BYPSHAD ) == RESET )
        {
            if( RTC_WaitForSynchro() == ERROR )
            {
                status = ERROR;
            }
            else
            {
                status = SUCCESS;
            }
        }
        else
        {
            status = SUCCESS;
        }
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

