FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    return status;
}

/**
 * @brief  Fills each RTC_TimeStruct member with its default value
 *         (Time = 00h:00min:00sec).
 * @param  RTC_TimeStruct: pointer to a RTC_TimeTypeDef structure which will be
 *         initialized.
 * @retval None
 */
void RTC_TimeStructInit( RTC_TimeTypeDef * RTC_TimeStruct )
{
    /* Time = 00h:00min:00sec */
    RTC_TimeStruct->RTC_H12 = RTC_H12_AM;
    RTC_TimeStruct->RTC_Hours = 0;
    RTC_TimeStruct->RTC_Minutes = 0;
    RTC_TimeStruct->RTC_Seconds = 0;
}

/**
 * @brief  Get the RTC current Time.
 * @param  RTC_Format: specifies the format of the returned parameters.
 *   This parameter can be  one of the following values:
 *     @arg RTC_Format_BIN:  Binary data format.
 *     @arg RTC_Format_BCD:  BCD data format.
 * @param RTC_TimeStruct: pointer to a RTC_TimeTypeDef structure that will
 *                        contain the returned current time configuration.
 * @retval None
 */
void RTC_GetTime( uint32_t RTC_Format,
                  RTC_TimeTypeDef * RTC_TimeStruct )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );

    /* Get the RTC_TR register */
    tmpreg = ( uint32_t ) ( RTC->TR & RTC_TR_RESERVED_MASK );

    /* Fill the structure fields with the read parameters */
    RTC_TimeStruct->RTC_Hours = ( uint8_t ) ( ( tmpreg & ( RTC_TR_HT | RTC_TR_HU ) ) >> 16 );
    RTC_TimeStruct->RTC_Minutes = ( uint8_t ) ( ( tmpreg & ( RTC_TR_MNT | RTC_TR_MNU ) ) >> 8 );
    RTC_TimeStruct->RTC_Seconds = ( uint8_t ) ( tmpreg & ( RTC_TR_ST | RTC_TR_SU ) );
    RTC_TimeStruct->RTC_H12 = ( uint8_t ) ( ( tmpreg & ( RTC_TR_PM ) ) >> 16 );

    /* Check the input parameters format */
    if( RTC_Format == RTC_Format_BIN )
    {
        /* Convert the structure parameters to Binary format */
        RTC_TimeStruct->RTC_Hours = ( uint8_t ) RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Hours );
        RTC_TimeStruct->RTC_Minutes = ( uint8_t ) RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Minutes );
        RTC_TimeStruct->RTC_Seconds = ( uint8_t ) RTC_Bcd2ToByte( RTC_TimeStruct->RTC_Seconds );
    }
}

/**
 * @brief  Gets the RTC current Calendar Subseconds value.
 * @note   This function freeze the Time and Date registers after reading the
 *         SSR register.
 * @param  None
 * @retval RTC current Calendar Subseconds value.
 */
uint32_t RTC_GetSubSecond( void )
{
    uint32_t tmpreg = 0;

    /* Get subseconds values from the correspondent registers*/
    tmpreg = ( uint32_t ) ( RTC->SSR );

    /* Read DR register to unfroze calendar registers */
    ( void ) ( RTC->DR );

    return( tmpreg );
}

/**
 * @brief  Set the RTC current date.
 * @param  RTC_Format: specifies the format of the entered parameters.
 *   This parameter can be  one of the following values:
 *     @arg RTC_Format_BIN:  Binary data format.
 *     @arg RTC_Format_BCD:  BCD data format.
 * @param  RTC_DateStruct: pointer to a RTC_DateTypeDef structure that contains
 *                         the date configuration information for the RTC.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC Date register is configured
 *          - ERROR: RTC Date register is not configured
 */
ErrorStatus RTC_SetDate( uint32_t RTC_Format,
                         RTC_DateTypeDef * RTC_DateStruct )
{
    uint32_t tmpreg = 0;
    ErrorStatus status = ERROR;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );

    if( ( RTC_Format == RTC_Format_BIN ) && ( ( RTC_DateStruct->RTC_Month & 0x10 ) == 0x10 ) )
    {
        RTC_DateStruct->RTC_Month = ( RTC_DateStruct->RTC_Month & ( uint32_t ) ~( 0x10 ) ) + 0x0A;
    }

    if( RTC_Format == RTC_Format_BIN )
    {
        assert_param( IS_RTC_YEAR( RTC_DateStruct->RTC_Year ) );
        assert_param( IS_RTC_MONTH( RTC_DateStruct->RTC_Month ) );
        assert_param( IS_RTC_DATE( RTC_DateStruct->RTC_Date ) );
    }
    else
    {
        assert_param( IS_RTC_YEAR( RTC_Bcd2ToByte( RTC_DateStruct->RTC_Year ) ) );
        tmpreg = RTC_Bcd2ToByte( RTC_DateStruct->RTC_Month );
        assert_param( IS_RTC_MONTH( tmpreg ) );
        tmpreg = RTC_Bcd2ToByte( RTC_DateStruct->RTC_Date );
        assert_param( IS_RTC_DATE( tmpreg ) );
    }

    assert_param( IS_RTC_WEEKDAY( RTC_DateStruct->RTC_WeekDay ) );

    /* Check the input parameters format */
    if( RTC_Format != RTC_Format_BIN )
    {
        tmpreg = ( ( ( ( uint32_t ) RTC_DateStruct->RTC_Year ) << 16 ) | \
                   ( ( ( uint32_t ) RTC_DateStruct->RTC_Month ) << 8 ) | \
                   ( ( uint32_t ) RTC_DateStruct->RTC_Date ) |           \
                   ( ( ( uint32_t ) RTC_DateStruct->RTC_WeekDay ) << 13 ) );
    }
    else
    {
        tmpreg = ( ( ( uint32_t ) RTC_ByteToBcd2( RTC_DateStruct->RTC_Year ) << 16 ) | \
                   ( ( uint32_t ) RTC_ByteToBcd2( RTC_DateStruct->RTC_Month ) << 8 ) | \
                   ( ( uint32_t ) RTC_ByteToBcd2( RTC_DateStruct->RTC_Date ) ) |       \
                   ( ( uint32_t ) RTC_DateStruct->RTC_WeekDay << 13 ) );
    }

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Set Initialization mode */
    if( RTC_EnterInitMode() == ERROR )
    {
        status = ERROR;
    }
    else
    {
        /* Set the RTC_DR register */
        RTC->DR = ( uint32_t ) ( tmpreg & RTC_DR_RESERVED_MASK );

        /* Exit Initialization mode */
        RTC_ExitInitMode();

        /* If  RTC_CR_BYPSHAD bit = 0, wait for synchro else this check is not needed */
        if( ( RTC->CR & RTC_CR_BYPSHAD ) == RESET )
        {
            if( RTC_WaitForSynchro() == ERROR )
            {
                status = ERROR;
            }
            else
            {
                status = SUCCESS;
            }
        }
        else
        {
            status = SUCCESS;
        }
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

    return status;
}

/**
 * @brief  Fills each RTC_DateStruct member with its default value
 *         (Monday, January 01 xx00).
 * @param  RTC_DateStruct: pointer to a RTC_DateTypeDef structure which will be
 *         initialized.
 * @retval None
 */
void RTC_DateStructInit( RTC_DateTypeDef * RTC_DateStruct )
{
    /* Monday, January 01 xx00 */
    RTC_DateStruct->RTC_WeekDay = RTC_Weekday_Monday;
    RTC_DateStruct->RTC_Date = 1;
    RTC_DateStruct->RTC_Month = RTC_Month_January;
    RTC_DateStruct->RTC_Year = 0;
}

/**
 * @brief  Get the RTC current date.
 * @param  RTC_Format: specifies the format of the returned parameters.
 *   This parameter can be one of the following values:
 *     @arg RTC_Format_BIN: Binary data format.
 *     @arg RTC_Format_BCD: BCD data format.
 * @param RTC_DateStruct: pointer to a RTC_DateTypeDef structure that will
 *                        contain the returned current date configuration.
 * @retval None
 */
void RTC_GetDate( uint32_t RTC_Format,
                  RTC_DateTypeDef * RTC_DateStruct )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );

    /* Get the RTC_TR register */
    tmpreg = ( uint32_t ) ( RTC->DR & RTC_DR_RESERVED_MASK );

    /* Fill the structure fields with the read parameters */
    RTC_DateStruct->RTC_Year = ( uint8_t ) ( ( tmpreg & ( RTC_DR_YT | RTC_DR_YU ) ) >> 16 );
    RTC_DateStruct->RTC_Month = ( uint8_t ) ( ( tmpreg & ( RTC_DR_MT | RTC_DR_MU ) ) >> 8 );
    RTC_DateStruct->RTC_Date = ( uint8_t ) ( tmpreg & ( RTC_DR_DT | RTC_DR_DU ) );
    RTC_DateStruct->RTC_WeekDay = ( uint8_t ) ( ( tmpreg & ( RTC_DR_WDU ) ) >> 13 );

    /* Check the input parameters format */
    if( RTC_Format == RTC_Format_BIN )
    {
        /* Convert the structure parameters to Binary format */
        RTC_DateStruct->RTC_Year = ( uint8_t ) RTC_Bcd2ToByte( RTC_DateStruct->RTC_Year );
        RTC_DateStruct->RTC_Month = ( uint8_t ) RTC_Bcd2ToByte( RTC_DateStruct->RTC_Month );
        RTC_DateStruct->RTC_Date = ( uint8_t ) RTC_Bcd2ToByte( RTC_DateStruct->RTC_Date );
    }
}

/**
 * @}
 */

/** @defgroup RTC_Group3 Alarms configuration functions
 *  @brief   Alarms (Alarm A and Alarm B) configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Alarms (Alarm A and Alarm B) configuration functions #####
 #####===============================================================================
 #####[..] This section provide functions allowing to program and read the RTC
 #####   Alarms.
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Set the specified RTC Alarm.
 * @note   The Alarm register can only be written when the corresponding Alarm
 *         is disabled (Use the RTC_AlarmCmd(DISABLE)).
 * @param  RTC_Format: specifies the format of the returned parameters.
 *   This parameter can be one of the following values:
 *     @arg RTC_Format_BIN: Binary data format.
 *     @arg RTC_Format_BCD: BCD data format.
 * @param  RTC_Alarm: specifies the alarm to be configured.
 *   This parameter can be one of the following values:
 *     @arg RTC_Alarm_A: to select Alarm A.
 *     @arg RTC_Alarm_B: to select Alarm B.
 * @param  RTC_AlarmStruct: pointer to a RTC_AlarmTypeDef structure that
 *                          contains the alarm configuration parameters.
 * @retval None
 */
void RTC_SetAlarm( uint32_t RTC_Format,
                   uint32_t RTC_Alarm,
                   RTC_AlarmTypeDef * RTC_AlarmStruct )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );
    assert_param( IS_RTC_ALARM( RTC_Alarm ) );
    assert_param( IS_ALARM_MASK( RTC_AlarmStruct->RTC_AlarmMask ) );
    assert_param( IS_RTC_ALARM_DATE_WEEKDAY_SEL( RTC_AlarmStruct->RTC_AlarmDateWeekDaySel ) );

    if( RTC_Format == RTC_Format_BIN )
    {
        if( ( RTC->CR & RTC_CR_FMT ) != ( uint32_t ) RESET )
        {
            assert_param( IS_RTC_HOUR12( RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours ) );
            assert_param( IS_RTC_H12( RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 ) );
        }
        else
        {
            RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 = 0x00;
            assert_param( IS_RTC_HOUR24( RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours ) );
        }

        assert_param( IS_RTC_MINUTES( RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes ) );
        assert_param( IS_RTC_SECONDS( RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds ) );

        if( RTC_AlarmStruct->RTC_AlarmDateWeekDaySel == RTC_AlarmDateWeekDaySel_Date )
        {
            assert_param( IS_RTC_ALARM_DATE_WEEKDAY_DATE( RTC_AlarmStruct->RTC_AlarmDateWeekDay ) );
        }
        else
        {
            assert_param( IS_RTC_ALARM_DATE_WEEKDAY_WEEKDAY( RTC_AlarmStruct->RTC_AlarmDateWeekDay ) );
        }
    }
    else
    {
        if( ( RTC->CR & RTC_CR_FMT ) != ( uint32_t ) RESET )
        {
            tmpreg = RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours );
            assert_param( IS_RTC_HOUR12( tmpreg ) );
            assert_param( IS_RTC_H12( RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 ) );
        }
        else
        {
            RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 = 0x00;
            assert_param( IS_RTC_HOUR24( RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours ) ) );
        }

