FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
        assert_param( IS_RTC_MINUTES( RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes ) ) );
        assert_param( IS_RTC_SECONDS( RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds ) ) );

        if( RTC_AlarmStruct->RTC_AlarmDateWeekDaySel == RTC_AlarmDateWeekDaySel_Date )
        {
            tmpreg = RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmDateWeekDay );
            assert_param( IS_RTC_ALARM_DATE_WEEKDAY_DATE( tmpreg ) );
        }
        else
        {
            tmpreg = RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmDateWeekDay );
            assert_param( IS_RTC_ALARM_DATE_WEEKDAY_WEEKDAY( tmpreg ) );
        }
    }

    /* Check the input parameters format */
    if( RTC_Format != RTC_Format_BIN )
    {
        tmpreg = ( ( ( uint32_t ) ( RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours ) << 16 ) |  \
                   ( ( uint32_t ) ( RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes ) << 8 ) | \
                   ( ( uint32_t ) RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds ) |          \
                   ( ( uint32_t ) ( RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 ) << 16 ) |    \
                   ( ( uint32_t ) ( RTC_AlarmStruct->RTC_AlarmDateWeekDay ) << 24 ) |     \
                   ( ( uint32_t ) RTC_AlarmStruct->RTC_AlarmDateWeekDaySel ) |            \
                   ( ( uint32_t ) RTC_AlarmStruct->RTC_AlarmMask ) );
    }
    else
    {
        tmpreg = ( ( ( uint32_t ) RTC_ByteToBcd2( RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours ) << 16 ) |  \
                   ( ( uint32_t ) RTC_ByteToBcd2( RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes ) << 8 ) | \
                   ( ( uint32_t ) RTC_ByteToBcd2( RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds ) ) |      \
                   ( ( uint32_t ) ( RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 ) << 16 ) |                  \
                   ( ( uint32_t ) RTC_ByteToBcd2( RTC_AlarmStruct->RTC_AlarmDateWeekDay ) << 24 ) |     \
                   ( ( uint32_t ) RTC_AlarmStruct->RTC_AlarmDateWeekDaySel ) |                          \
                   ( ( uint32_t ) RTC_AlarmStruct->RTC_AlarmMask ) );
    }

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Configure the Alarm register */
    if( RTC_Alarm == RTC_Alarm_A )
    {
        RTC->ALRMAR = ( uint32_t ) tmpreg;
    }
    else
    {
        RTC->ALRMBR = ( uint32_t ) tmpreg;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;
}

/**
 * @brief  Fills each RTC_AlarmStruct member with its default value
 *         (Time = 00h:00mn:00sec / Date = 1st day of the month/Mask =
 *         all fields are masked).
 * @param  RTC_AlarmStruct: pointer to a @ref RTC_AlarmTypeDef structure which
 *         will be initialized.
 * @retval None
 */
void RTC_AlarmStructInit( RTC_AlarmTypeDef * RTC_AlarmStruct )
{
    /* Alarm Time Settings : Time = 00h:00mn:00sec */
    RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 = RTC_H12_AM;
    RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours = 0;
    RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes = 0;
    RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds = 0;

    /* Alarm Date Settings : Date = 1st day of the month */
    RTC_AlarmStruct->RTC_AlarmDateWeekDaySel = RTC_AlarmDateWeekDaySel_Date;
    RTC_AlarmStruct->RTC_AlarmDateWeekDay = 1;

    /* Alarm Masks Settings : Mask =  all fields are not masked */
    RTC_AlarmStruct->RTC_AlarmMask = RTC_AlarmMask_None;
}

/**
 * @brief  Get the RTC Alarm value and masks.
 * @param  RTC_Format: specifies the format of the output parameters.
 *   This parameter can be one of the following values:
 *     @arg RTC_Format_BIN: Binary data format.
 *     @arg RTC_Format_BCD: BCD data format.
 * @param  RTC_Alarm: specifies the alarm to be read.
 *   This parameter can be one of the following values:
 *     @arg RTC_Alarm_A: to select Alarm A.
 *     @arg RTC_Alarm_B: to select Alarm B.
 * @param  RTC_AlarmStruct: pointer to a RTC_AlarmTypeDef structure that will
 *                          contains the output alarm configuration values.
 * @retval None
 */
void RTC_GetAlarm( uint32_t RTC_Format,
                   uint32_t RTC_Alarm,
                   RTC_AlarmTypeDef * RTC_AlarmStruct )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );
    assert_param( IS_RTC_ALARM( RTC_Alarm ) );

    /* Get the RTC_ALRMxR register */
    if( RTC_Alarm == RTC_Alarm_A )
    {
        tmpreg = ( uint32_t ) ( RTC->ALRMAR );
    }
    else
    {
        tmpreg = ( uint32_t ) ( RTC->ALRMBR );
    }

    /* Fill the structure with the read parameters */
    RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours = ( uint32_t ) ( ( tmpreg & ( RTC_ALRMAR_HT | \
                                                                           RTC_ALRMAR_HU ) ) >> 16 );
    RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes = ( uint32_t ) ( ( tmpreg & ( RTC_ALRMAR_MNT | \
                                                                             RTC_ALRMAR_MNU ) ) >> 8 );
    RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds = ( uint32_t ) ( tmpreg & ( RTC_ALRMAR_ST | \
                                                                           RTC_ALRMAR_SU ) );
    RTC_AlarmStruct->RTC_AlarmTime.RTC_H12 = ( uint32_t ) ( ( tmpreg & RTC_ALRMAR_PM ) >> 16 );
    RTC_AlarmStruct->RTC_AlarmDateWeekDay = ( uint32_t ) ( ( tmpreg & ( RTC_ALRMAR_DT | RTC_ALRMAR_DU ) ) >> 24 );
    RTC_AlarmStruct->RTC_AlarmDateWeekDaySel = ( uint32_t ) ( tmpreg & RTC_ALRMAR_WDSEL );
    RTC_AlarmStruct->RTC_AlarmMask = ( uint32_t ) ( tmpreg & RTC_AlarmMask_All );

    if( RTC_Format == RTC_Format_BIN )
    {
        RTC_AlarmStruct->RTC_AlarmTime.RTC_Hours = RTC_Bcd2ToByte( RTC_AlarmStruct-> \
                                                                      RTC_AlarmTime.RTC_Hours );
        RTC_AlarmStruct->RTC_AlarmTime.RTC_Minutes = RTC_Bcd2ToByte( RTC_AlarmStruct-> \
                                                                        RTC_AlarmTime.RTC_Minutes );
        RTC_AlarmStruct->RTC_AlarmTime.RTC_Seconds = RTC_Bcd2ToByte( RTC_AlarmStruct-> \
                                                                        RTC_AlarmTime.RTC_Seconds );
        RTC_AlarmStruct->RTC_AlarmDateWeekDay = RTC_Bcd2ToByte( RTC_AlarmStruct->RTC_AlarmDateWeekDay );
    }
}

/**
 * @brief  Enables or disables the specified RTC Alarm.
 * @param  RTC_Alarm: specifies the alarm to be configured.
 *   This parameter can be any combination of the following values:
 *     @arg RTC_Alarm_A: to select Alarm A.
 *     @arg RTC_Alarm_B: to select Alarm B.
 * @param  NewState: new state of the specified alarm.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC Alarm is enabled/disabled
 *          - ERROR: RTC Alarm is not enabled/disabled
 */
ErrorStatus RTC_AlarmCmd( uint32_t RTC_Alarm,
                          FunctionalState NewState )
{
    __IO uint32_t alarmcounter = 0x00;
    uint32_t alarmstatus = 0x00;
    ErrorStatus status = ERROR;

    /* Check the parameters */
    assert_param( IS_RTC_CMD_ALARM( RTC_Alarm ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Configure the Alarm state */
    if( NewState != DISABLE )
    {
        RTC->CR |= ( uint32_t ) RTC_Alarm;

        status = SUCCESS;
    }
    else
    {
        /* Disable the Alarm in RTC_CR register */
        RTC->CR &= ( uint32_t ) ~RTC_Alarm;

        /* Wait till RTC ALRxWF flag is set and if Time out is reached exit */
        do
        {
            alarmstatus = RTC->ISR & ( RTC_Alarm >> 8 );
            alarmcounter++;
        } while( ( alarmcounter != INITMODE_TIMEOUT ) && ( alarmstatus == 0x00 ) );

