FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    return status;
}

/**
 * @brief  Enables or disables the Coarse calibration process.
 * @param  NewState: new state of the Coarse calibration.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC Coarse calibration are enabled/disabled
 *          - ERROR: RTC Coarse calibration are not enabled/disabled
 */
ErrorStatus RTC_CoarseCalibCmd( FunctionalState NewState )
{
    ErrorStatus status = ERROR;

    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Set Initialization mode */
    if( RTC_EnterInitMode() == ERROR )
    {
        status = ERROR;
    }
    else
    {
        if( NewState != DISABLE )
        {
            /* Enable the Coarse Calibration */
            RTC->CR |= ( uint32_t ) RTC_CR_DCE;
        }
        else
        {
            /* Disable the Coarse Calibration */
            RTC->CR &= ( uint32_t ) ~RTC_CR_DCE;
        }

        /* Exit Initialization mode */
        RTC_ExitInitMode();

        status = SUCCESS;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

    return status;
}

/**
 * @brief  Enables or disables the RTC clock to be output through the relative
 *         pin.
 * @param  NewState: new state of the coarse calibration Output.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_CalibOutputCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    if( NewState != DISABLE )
    {
        /* Enable the RTC clock output */
        RTC->CR |= ( uint32_t ) RTC_CR_COE;
    }
    else
    {
        /* Disable the RTC clock output */
        RTC->CR &= ( uint32_t ) ~RTC_CR_COE;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;
}

/**
 * @brief  Configure the Calibration Pinout (RTC_CALIB) Selection (1Hz or 512Hz).
 * @param  RTC_CalibOutput : Select the Calibration output Selection .
 *   This parameter can be one of the following values:
 *     @arg RTC_CalibOutput_512Hz: A signal has a regular waveform at 512Hz.
 *     @arg RTC_CalibOutput_1Hz: A signal has a regular waveform at 1Hz.
 * @retval None
 */
void RTC_CalibOutputConfig( uint32_t RTC_CalibOutput )
{
    /* Check the parameters */
    assert_param( IS_RTC_CALIB_OUTPUT( RTC_CalibOutput ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /*clear flags before config*/
    RTC->CR &= ( uint32_t ) ~( RTC_CR_COSEL );

    /* Configure the RTC_CR register */
    RTC->CR |= ( uint32_t ) RTC_CalibOutput;

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;
}

/**
 * @brief  Configures the Smooth Calibration Settings.
 * @param  RTC_SmoothCalibPeriod: Select the Smooth Calibration Period.
 *   This parameter can be can be one of the following values:
 *     @arg RTC_SmoothCalibPeriod_32sec: The smooth calibration periode is 32s.
 *     @arg RTC_SmoothCalibPeriod_16sec: The smooth calibration periode is 16s.
 *     @arg RTC_SmoothCalibPeriod_8sec: The smooth calibartion periode is 8s.
 * @param  RTC_SmoothCalibPlusPulses: Select to Set or reset the CALP bit.
 *   This parameter can be one of the following values:
 *     @arg RTC_SmoothCalibPlusPulses_Set: Add one RTCCLK puls every 2**11 pulses.
 *     @arg RTC_SmoothCalibPlusPulses_Reset: No RTCCLK pulses are added.
 * @param  RTC_SmouthCalibMinusPulsesValue: Select the value of CALM[8:0] bits.
 *   This parameter can be one any value from 0 to 0x000001FF.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC Calib registers are configured
 *          - ERROR: RTC Calib registers are not configured
 */
ErrorStatus RTC_SmoothCalibConfig( uint32_t RTC_SmoothCalibPeriod,
                                   uint32_t RTC_SmoothCalibPlusPulses,
                                   uint32_t RTC_SmouthCalibMinusPulsesValue )
{
    ErrorStatus status = ERROR;
    uint32_t recalpfcount = 0;

    /* Check the parameters */
    assert_param( IS_RTC_SMOOTH_CALIB_PERIOD( RTC_SmoothCalibPeriod ) );
    assert_param( IS_RTC_SMOOTH_CALIB_PLUS( RTC_SmoothCalibPlusPulses ) );
    assert_param( IS_RTC_SMOOTH_CALIB_MINUS( RTC_SmouthCalibMinusPulsesValue ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* check if a calibration is pending*/
    if( ( RTC->ISR & RTC_ISR_RECALPF ) != RESET )
    {
        /* wait until the Calibration is completed*/
        while( ( ( RTC->ISR & RTC_ISR_RECALPF ) != RESET ) && ( recalpfcount != RECALPF_TIMEOUT ) )
        {
            recalpfcount++;
        }
    }

    /* check if the calibration pending is completed or if there is no calibration operation at all*/
    if( ( RTC->ISR & RTC_ISR_RECALPF ) == RESET )
    {
        /* Configure the Smooth calibration settings */
        RTC->CALR = ( uint32_t ) ( ( uint32_t ) RTC_SmoothCalibPeriod | ( uint32_t ) RTC_SmoothCalibPlusPulses | ( uint32_t ) RTC_SmouthCalibMinusPulsesValue );

        status = SUCCESS;
    }
    else
    {
        status = ERROR;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

    return ( ErrorStatus ) ( status );
}

/**
 * @}
 */


/** @defgroup RTC_Group8 TimeStamp configuration functions
 *  @brief   TimeStamp configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### TimeStamp configuration functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables or Disables the RTC TimeStamp functionality with the
 *         specified time stamp pin stimulating edge.
 * @param  RTC_TimeStampEdge: Specifies the pin edge on which the TimeStamp is
 *         activated.
 *   This parameter can be one of the following:
 *     @arg RTC_TimeStampEdge_Rising: the Time stamp event occurs on the rising
 *                                    edge of the related pin.
 *     @arg RTC_TimeStampEdge_Falling: the Time stamp event occurs on the
 *                                     falling edge of the related pin.
 * @param  NewState: new state of the TimeStamp.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_TimeStampCmd( uint32_t RTC_TimeStampEdge,
                       FunctionalState NewState )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_TIMESTAMP_EDGE( RTC_TimeStampEdge ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

