FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    /* Get the RTC_CR register and clear the bits to be configured */
    tmpreg = ( uint32_t ) ( RTC->CR & ( uint32_t ) ~( RTC_CR_TSEDGE | RTC_CR_TSE ) );

    /* Get the new configuration */
    if( NewState != DISABLE )
    {
        tmpreg |= ( uint32_t ) ( RTC_TimeStampEdge | RTC_CR_TSE );
    }
    else
    {
        tmpreg |= ( uint32_t ) ( RTC_TimeStampEdge );
    }

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Configure the Time Stamp TSEDGE and Enable bits */
    RTC->CR = ( uint32_t ) tmpreg;

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;
}

/**
 * @brief  Get the RTC TimeStamp value and masks.
 * @param  RTC_Format: specifies the format of the output parameters.
 *   This parameter can be one of the following values:
 *     @arg RTC_Format_BIN: Binary data format
 *     @arg RTC_Format_BCD: BCD data format
 * @param RTC_StampTimeStruct: pointer to a RTC_TimeTypeDef structure that will
 *                             contains the TimeStamp time values.
 * @param RTC_StampDateStruct: pointer to a RTC_DateTypeDef structure that will
 *                             contains the TimeStamp date values.
 * @retval None
 */
void RTC_GetTimeStamp( uint32_t RTC_Format,
                       RTC_TimeTypeDef * RTC_StampTimeStruct,
                       RTC_DateTypeDef * RTC_StampDateStruct )
{
    uint32_t tmptime = 0, tmpdate = 0;

    /* Check the parameters */
    assert_param( IS_RTC_FORMAT( RTC_Format ) );

    /* Get the TimeStamp time and date registers values */
    tmptime = ( uint32_t ) ( RTC->TSTR & RTC_TR_RESERVED_MASK );
    tmpdate = ( uint32_t ) ( RTC->TSDR & RTC_DR_RESERVED_MASK );

    /* Fill the Time structure fields with the read parameters */
    RTC_StampTimeStruct->RTC_Hours = ( uint8_t ) ( ( tmptime & ( RTC_TR_HT | RTC_TR_HU ) ) >> 16 );
    RTC_StampTimeStruct->RTC_Minutes = ( uint8_t ) ( ( tmptime & ( RTC_TR_MNT | RTC_TR_MNU ) ) >> 8 );
    RTC_StampTimeStruct->RTC_Seconds = ( uint8_t ) ( tmptime & ( RTC_TR_ST | RTC_TR_SU ) );
    RTC_StampTimeStruct->RTC_H12 = ( uint8_t ) ( ( tmptime & ( RTC_TR_PM ) ) >> 16 );

    /* Fill the Date structure fields with the read parameters */
    RTC_StampDateStruct->RTC_Year = 0;
    RTC_StampDateStruct->RTC_Month = ( uint8_t ) ( ( tmpdate & ( RTC_DR_MT | RTC_DR_MU ) ) >> 8 );
    RTC_StampDateStruct->RTC_Date = ( uint8_t ) ( tmpdate & ( RTC_DR_DT | RTC_DR_DU ) );
    RTC_StampDateStruct->RTC_WeekDay = ( uint8_t ) ( ( tmpdate & ( RTC_DR_WDU ) ) >> 13 );

    /* Check the input parameters format */
    if( RTC_Format == RTC_Format_BIN )
    {
        /* Convert the Time structure parameters to Binary format */
        RTC_StampTimeStruct->RTC_Hours = ( uint8_t ) RTC_Bcd2ToByte( RTC_StampTimeStruct->RTC_Hours );
        RTC_StampTimeStruct->RTC_Minutes = ( uint8_t ) RTC_Bcd2ToByte( RTC_StampTimeStruct->RTC_Minutes );
        RTC_StampTimeStruct->RTC_Seconds = ( uint8_t ) RTC_Bcd2ToByte( RTC_StampTimeStruct->RTC_Seconds );

        /* Convert the Date structure parameters to Binary format */
        RTC_StampDateStruct->RTC_Month = ( uint8_t ) RTC_Bcd2ToByte( RTC_StampDateStruct->RTC_Month );
        RTC_StampDateStruct->RTC_Date = ( uint8_t ) RTC_Bcd2ToByte( RTC_StampDateStruct->RTC_Date );
        RTC_StampDateStruct->RTC_WeekDay = ( uint8_t ) RTC_Bcd2ToByte( RTC_StampDateStruct->RTC_WeekDay );
    }
}

/**
 * @brief  Get the RTC timestamp Subseconds value.
 * @param  None
 * @retval RTC current timestamp Subseconds value.
 */
uint32_t RTC_GetTimeStampSubSecond( void )
{
    /* Get timestamp subseconds values from the correspondent registers */
    return ( uint32_t ) ( RTC->TSSSR );
}

/**
 * @}
 */

/** @defgroup RTC_Group9 Tampers configuration functions
 *  @brief   Tampers configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Tampers configuration functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the select Tamper pin edge.
 * @param  RTC_Tamper: Selected tamper pin.
 *   This parameter can be any combination of the following values:
 *     @arg RTC_Tamper_1: Select Tamper 1.
 *     @arg RTC_Tamper_2: Select Tamper 2.
 *     @arg RTC_Tamper_3: Select Tamper 3.
 * @param  RTC_TamperTrigger: Specifies the trigger on the tamper pin that
 *                            stimulates tamper event.
 *   This parameter can be one of the following values:
 *     @arg RTC_TamperTrigger_RisingEdge: Rising Edge of the tamper pin causes tamper event.
 *     @arg RTC_TamperTrigger_FallingEdge: Falling Edge of the tamper pin causes tamper event.
 *     @arg RTC_TamperTrigger_LowLevel: Low Level of the tamper pin causes tamper event.
 *     @arg RTC_TamperTrigger_HighLevel: High Level of the tamper pin causes tamper event.
 * @retval None
 */
void RTC_TamperTriggerConfig( uint32_t RTC_Tamper,
                              uint32_t RTC_TamperTrigger )
{
    /* Check the parameters */
    assert_param( IS_RTC_TAMPER( RTC_Tamper ) );
    assert_param( IS_RTC_TAMPER_TRIGGER( RTC_TamperTrigger ) );

    /* Check if the  active level for Tamper is rising edge (Low level)*/
    if( RTC_TamperTrigger == RTC_TamperTrigger_RisingEdge )
    {
        /* Configure the RTC_TAFCR register */
        RTC->TAFCR &= ( uint32_t ) ( ( uint32_t ) ~( RTC_Tamper << 1 ) );
    }
    else
    {
        /* Configure the RTC_TAFCR register */
        RTC->TAFCR |= ( uint32_t ) ( RTC_Tamper << 1 );
    }
}

/**
 * @brief  Enables or Disables the Tamper detection.
 * @param  RTC_Tamper: Selected tamper pin.
 *   This parameter can be any combination of the following values:
 *     @arg RTC_Tamper_1: Select Tamper 1.
 *     @arg RTC_Tamper_2: Select Tamper 2.
 *     @arg RTC_Tamper_3: Select Tamper 3.
 * @param  NewState: new state of the tamper pin.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_TamperCmd( uint32_t RTC_Tamper,
                    FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_RTC_TAMPER( RTC_Tamper ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Enable the selected Tamper pin */
        RTC->TAFCR |= ( uint32_t ) RTC_Tamper;
    }
    else
    {
        /* Disable the selected Tamper pin */
        RTC->TAFCR &= ( uint32_t ) ~RTC_Tamper;
    }
}

/**
 * @brief  Configures the Tampers Filter.
 * @param  RTC_TamperFilter: Specifies the tampers filter.
 *   This parameter can be one of the following values:
 *     @arg RTC_TamperFilter_Disable: Tamper filter is disabled.
 *     @arg RTC_TamperFilter_2Sample: Tamper is activated after 2 consecutive
 *                                    samples at the active level.
 *     @arg RTC_TamperFilter_4Sample: Tamper is activated after 4 consecutive
 *                                    samples at the active level.
 *     @arg RTC_TamperFilter_8Sample: Tamper is activated after 8 consecutive
 *                                    samples at the active level.
 * @retval None
 */
void RTC_TamperFilterConfig( uint32_t RTC_TamperFilter )
{
    /* Check the parameters */
    assert_param( IS_RTC_TAMPER_FILTER( RTC_TamperFilter ) );

