FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    /* Clear TAMPFLT[1:0] bits in the RTC_TAFCR register */
    RTC->TAFCR &= ( uint32_t ) ~( RTC_TAFCR_TAMPFLT );

    /* Configure the RTC_TAFCR register */
    RTC->TAFCR |= ( uint32_t ) RTC_TamperFilter;
}

/**
 * @brief  Configures the Tampers Sampling Frequency.
 * @param  RTC_TamperSamplingFreq: Specifies the tampers Sampling Frequency.
 *   This parameter can be one of the following values:
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div32768: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 32768
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div16384: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 16384
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div8192: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 8192
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div4096: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 4096
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div2048: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 2048
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div1024: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 1024
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div512: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 512
 *     @arg RTC_TamperSamplingFreq_RTCCLK_Div256: Each of the tamper inputs are sampled
 *                                           with a frequency =  RTCCLK / 256
 * @retval None
 */
void RTC_TamperSamplingFreqConfig( uint32_t RTC_TamperSamplingFreq )
{
    /* Check the parameters */
    assert_param( IS_RTC_TAMPER_SAMPLING_FREQ( RTC_TamperSamplingFreq ) );

    /* Clear TAMPFREQ[2:0] bits in the RTC_TAFCR register */
    RTC->TAFCR &= ( uint32_t ) ~( RTC_TAFCR_TAMPFREQ );

    /* Configure the RTC_TAFCR register */
    RTC->TAFCR |= ( uint32_t ) RTC_TamperSamplingFreq;
}

/**
 * @brief  Configures the Tampers Pins input Precharge Duration.
 * @param  RTC_TamperPrechargeDuration: Specifies the Tampers Pins input
 *         Precharge Duration.
 *   This parameter can be one of the following values:
 *     @arg RTC_TamperPrechargeDuration_1RTCCLK: Tamper pins are pre-charged before sampling during 1 RTCCLK cycle.
 *     @arg RTC_TamperPrechargeDuration_2RTCCLK: Tamper pins are pre-charged before sampling during 2 RTCCLK cycle.
 *     @arg RTC_TamperPrechargeDuration_4RTCCLK: Tamper pins are pre-charged before sampling during 4 RTCCLK cycle.
 *     @arg RTC_TamperPrechargeDuration_8RTCCLK: Tamper pins are pre-charged before sampling during 8 RTCCLK cycle.
 * @retval None
 */
void RTC_TamperPinsPrechargeDuration( uint32_t RTC_TamperPrechargeDuration )
{
    /* Check the parameters */
    assert_param( IS_RTC_TAMPER_PRECHARGE_DURATION( RTC_TamperPrechargeDuration ) );

    /* Clear TAMPPRCH[1:0] bits in the RTC_TAFCR register */
    RTC->TAFCR &= ( uint32_t ) ~( RTC_TAFCR_TAMPPRCH );

    /* Configure the RTC_TAFCR register */
    RTC->TAFCR |= ( uint32_t ) RTC_TamperPrechargeDuration;
}

/**
 * @brief  Enables or Disables the TimeStamp on Tamper Detection Event.
 * @note   The timestamp is valid even the TSE bit in tamper control register
 *         is reset.
 * @param  NewState: new state of the timestamp on tamper event.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_TimeStampOnTamperDetectionCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Save timestamp on tamper detection event */
        RTC->TAFCR |= ( uint32_t ) RTC_TAFCR_TAMPTS;
    }
    else
    {
        /* Tamper detection does not cause a timestamp to be saved */
        RTC->TAFCR &= ( uint32_t ) ~RTC_TAFCR_TAMPTS;
    }
}

/**
 * @brief  Enables or Disables the Precharge of Tamper pin.
 * @param  NewState: new state of tamper pull up.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_TamperPullUpCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Enable precharge of the selected Tamper pin */
        RTC->TAFCR &= ( uint32_t ) ~RTC_TAFCR_TAMPPUDIS;
    }
    else
    {
        /* Disable precharge of the selected Tamper pin */
        RTC->TAFCR |= ( uint32_t ) RTC_TAFCR_TAMPPUDIS;
    }
}

/**
 * @}
 */

/** @defgroup RTC_Group10 Backup Data Registers configuration functions
 *  @brief   Backup Data Registers configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Backup Data Registers configuration functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Writes a data in a specified RTC Backup data register.
 * @param  RTC_BKP_DR: RTC Backup data Register number.
 *   This parameter can be: RTC_BKP_DRx where x can be from 0 to 19 to
 *                          specify the register.
 * @param  Data: Data to be written in the specified RTC Backup data register.
 * @retval None
 */
void RTC_WriteBackupRegister( uint32_t RTC_BKP_DR,
                              uint32_t Data )
{
    __IO uint32_t tmp = 0;

    /* Check the parameters */
    assert_param( IS_RTC_BKP( RTC_BKP_DR ) );

    tmp = RTC_BASE + 0x50;
    tmp += ( RTC_BKP_DR * 4 );

    /* Write the specified register */
    *( __IO uint32_t * ) tmp = ( uint32_t ) Data;
}

/**
 * @brief  Reads data from the specified RTC Backup data Register.
 * @param  RTC_BKP_DR: RTC Backup data Register number.
 *   This parameter can be: RTC_BKP_DRx where x can be from 0 to 19 to
 *                          specify the register.
 * @retval None
 */
uint32_t RTC_ReadBackupRegister( uint32_t RTC_BKP_DR )
{
    __IO uint32_t tmp = 0;

    /* Check the parameters */
    assert_param( IS_RTC_BKP( RTC_BKP_DR ) );

    tmp = RTC_BASE + 0x50;
    tmp += ( RTC_BKP_DR * 4 );

