FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    /* Read the specified register */
    return( *( __IO uint32_t * ) tmp );
}

/**
 * @}
 */

/** @defgroup RTC_Group11 Output Type Config configuration functions
 *  @brief   Output Type Config configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Output Type Config configuration functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the RTC Output Pin mode.
 * @param  RTC_OutputType: specifies the RTC Output (PC13) pin mode.
 *   This parameter can be one of the following values:
 *     @arg RTC_OutputType_OpenDrain: RTC Output (PC13) is configured in
 *                                    Open Drain mode.
 *     @arg RTC_OutputType_PushPull:  RTC Output (PC13) is configured in
 *                                    Push Pull mode.
 * @retval None
 */
void RTC_OutputTypeConfig( uint32_t RTC_OutputType )
{
    /* Check the parameters */
    assert_param( IS_RTC_OUTPUT_TYPE( RTC_OutputType ) );

    RTC->TAFCR &= ( uint32_t ) ~( RTC_TAFCR_ALARMOUTTYPE );
    RTC->TAFCR |= ( uint32_t ) ( RTC_OutputType );
}

/**
 * @}
 */

/** @defgroup RTC_Group12 Shift control synchronisation functions
 *  @brief   Shift control synchronisation functions
 *
 * @verbatim
 * ===============================================================================
 ##### Shift control synchronisation functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the Synchronization Shift Control Settings.
 * @note   When REFCKON is set, firmware must not write to Shift control register
 * @param  RTC_ShiftAdd1S : Select to add or not 1 second to the time Calendar.
 *   This parameter can be one of the following values :
 *     @arg RTC_ShiftAdd1S_Set: Add one second to the clock calendar.
 *     @arg RTC_ShiftAdd1S_Reset: No effect.
 * @param  RTC_ShiftSubFS: Select the number of Second Fractions to Substitute.
 *         This parameter can be one any value from 0 to 0x7FFF.
 * @retval An ErrorStatus enumeration value:
 *          - SUCCESS: RTC Shift registers are configured
 *          - ERROR: RTC Shift registers are not configured
 */
ErrorStatus RTC_SynchroShiftConfig( uint32_t RTC_ShiftAdd1S,
                                    uint32_t RTC_ShiftSubFS )
{
    ErrorStatus status = ERROR;
    uint32_t shpfcount = 0;

    /* Check the parameters */
    assert_param( IS_RTC_SHIFT_ADD1S( RTC_ShiftAdd1S ) );
    assert_param( IS_RTC_SHIFT_SUBFS( RTC_ShiftSubFS ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    /* Check if a Shift is pending*/
    if( ( RTC->ISR & RTC_ISR_SHPF ) != RESET )
    {
        /* Wait until the shift is completed*/
        while( ( ( RTC->ISR & RTC_ISR_SHPF ) != RESET ) && ( shpfcount != SHPF_TIMEOUT ) )
        {
            shpfcount++;
        }
    }

    /* Check if the Shift pending is completed or if there is no Shift operation at all*/
    if( ( RTC->ISR & RTC_ISR_SHPF ) == RESET )
    {
        /* check if the reference clock detection is disabled */
        if( ( RTC->CR & RTC_CR_REFCKON ) == RESET )
        {
            /* Configure the Shift settings */
            RTC->SHIFTR = ( uint32_t ) ( uint32_t ) ( RTC_ShiftSubFS ) | ( uint32_t ) ( RTC_ShiftAdd1S );

            if( RTC_WaitForSynchro() == ERROR )
            {
                status = ERROR;
            }
            else
            {
                status = SUCCESS;
            }
        }
        else
        {
            status = ERROR;
        }
    }
    else
    {
        status = ERROR;
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;

    return ( ErrorStatus ) ( status );
}

/**
 * @}
 */

/** @defgroup RTC_Group13 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Interrupts and flags management functions #####
 #####===============================================================================
 #####[..] All RTC interrupts are connected to the EXTI controller.
 #####   (+) To enable the RTC Alarm interrupt, the following sequence is required:
 #####   (+) Configure and enable the EXTI Line 17 in interrupt mode and select
 #####       the rising edge sensitivity using the EXTI_Init() function.
 #####   (+) Configure and enable the RTC_Alarm IRQ channel in the NVIC using
 #####       the NVIC_Init() function.
 #####   (+) Configure the RTC to generate RTC alarms (Alarm A and/or Alarm B)
 #####       using the RTC_SetAlarm() and RTC_AlarmCmd() functions.
 #####
 #####   (+) To enable the RTC Wakeup interrupt, the following sequence is required:
 #####   (+) Configure and enable the EXTI Line 20 in interrupt mode and select
 #####       the rising edge sensitivity using the EXTI_Init() function.
 #####   (+) Configure and enable the RTC_WKUP IRQ channel in the NVIC using the
 #####       NVIC_Init() function.
 #####   (+) Configure the RTC to generate the RTC wakeup timer event using the
 #####       RTC_WakeUpClockConfig(), RTC_SetWakeUpCounter() and RTC_WakeUpCmd()
 #####       functions.
 #####
 #####   (+) To enable the RTC Tamper interrupt, the following sequence is required:
 #####   (+) Configure and enable the EXTI Line 19 in interrupt mode and select
 #####       the rising edge sensitivity using the EXTI_Init() function.
 #####   (+) Configure and enable the TAMP_STAMP IRQ channel in the NVIC using
 #####       the NVIC_Init() function.
 #####   (+) Configure the RTC to detect the RTC tamper event using the
 #####       RTC_TamperTriggerConfig() and RTC_TamperCmd() functions.
 #####
 #####   (+) To enable the RTC TimeStamp interrupt, the following sequence is
 #####       required:
 #####   (+) Configure and enable the EXTI Line 19 in interrupt mode and select
 #####       the rising edge sensitivity using the EXTI_Init() function.
 #####   (+) Configure and enable the TAMP_STAMP IRQ channel in the NVIC using
 #####       the NVIC_Init() function.
 #####   (+) Configure the RTC to detect the RTC time-stamp event using the
 #####       RTC_TimeStampCmd() functions.
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the specified RTC interrupts.
 * @param  RTC_IT: specifies the RTC interrupt sources to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg RTC_IT_TS:  Time Stamp interrupt mask.
 *     @arg RTC_IT_WUT:  WakeUp Timer interrupt mask.
 *     @arg RTC_IT_ALRB:  Alarm B interrupt mask.
 *     @arg RTC_IT_ALRA:  Alarm A interrupt mask.
 *     @arg RTC_IT_TAMP: Tamper event interrupt mask.
 * @param  NewState: new state of the specified RTC interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RTC_ITConfig( uint32_t RTC_IT,
                   FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_RTC_CONFIG_IT( RTC_IT ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Disable the write protection for RTC registers */
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    if( NewState != DISABLE )
    {
        /* Configure the Interrupts in the RTC_CR register */
        RTC->CR |= ( uint32_t ) ( RTC_IT & ~RTC_TAFCR_TAMPIE );
        /* Configure the Tamper Interrupt in the RTC_TAFCR */
        RTC->TAFCR |= ( uint32_t ) ( RTC_IT & RTC_TAFCR_TAMPIE );
    }
    else
    {
        /* Configure the Interrupts in the RTC_CR register */
        RTC->CR &= ( uint32_t ) ~( RTC_IT & ( uint32_t ) ~RTC_TAFCR_TAMPIE );
        /* Configure the Tamper Interrupt in the RTC_TAFCR */
        RTC->TAFCR &= ( uint32_t ) ~( RTC_IT & RTC_TAFCR_TAMPIE );
    }

    /* Enable the write protection for RTC registers */
    RTC->WPR = 0xFF;
}

/**
 * @brief  Checks whether the specified RTC flag is set or not.
 * @param  RTC_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg RTC_FLAG_RECALPF: RECALPF event flag.
 *     @arg RTC_FLAG_TAMP3F: Tamper 3 event flag.
 *     @arg RTC_FLAG_TAMP2F: Tamper 2 event flag.
 *     @arg RTC_FLAG_TAMP1F: Tamper 1 event flag.
 *     @arg RTC_FLAG_TSOVF: Time Stamp OverFlow flag.
 *     @arg RTC_FLAG_TSF: Time Stamp event flag.
 *     @arg RTC_FLAG_WUTF: WakeUp Timer flag.
 *     @arg RTC_FLAG_ALRBF: Alarm B flag.
 *     @arg RTC_FLAG_ALRAF: Alarm A flag.
 *     @arg RTC_FLAG_INITF: Initialization mode flag.
 *     @arg RTC_FLAG_RSF: Registers Synchronized flag.
 *     @arg RTC_FLAG_INITS: Registers Configured flag.
 *     @argRTC_FLAG_SHPF: Shift operation pending flag.
 *     @arg RTC_FLAG_WUTWF: WakeUp Timer Write flag.
 *     @arg RTC_FLAG_ALRBWF: Alarm B Write flag.
 *     @arg RTC_FLAG_ALRAWF: Alarm A write flag.
 * @retval The new state of RTC_FLAG (SET or RESET).
 */
FlagStatus RTC_GetFlagStatus( uint32_t RTC_FLAG )
{
    FlagStatus bitstatus = RESET;
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_GET_FLAG( RTC_FLAG ) );

    /* Get all the flags */
    tmpreg = ( uint32_t ) ( RTC->ISR & RTC_FLAGS_MASK );

    /* Return the status of the flag */
    if( ( tmpreg & RTC_FLAG ) != ( uint32_t ) RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

