FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_rtc.c
    return bitstatus;
}

/**
 * @brief  Clears the RTC's pending flags.
 * @param  RTC_FLAG: specifies the RTC flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg RTC_FLAG_TAMP3F: Tamper 3 event flag.
 *     @arg RTC_FLAG_TAMP2F: Tamper 2 event flag.
 *     @arg RTC_FLAG_TAMP1F: Tamper 1 event flag.
 *     @arg RTC_FLAG_TSOVF: Time Stamp Overflow flag.
 *     @arg RTC_FLAG_TSF: Time Stamp event flag.
 *     @arg RTC_FLAG_WUTF: WakeUp Timer flag.
 *     @arg RTC_FLAG_ALRBF: Alarm B flag.
 *     @arg RTC_FLAG_ALRAF: Alarm A flag.
 *     @arg RTC_FLAG_RSF: Registers Synchronized flag.
 * @retval None
 */
void RTC_ClearFlag( uint32_t RTC_FLAG )
{
    /* Check the parameters */
    assert_param( IS_RTC_CLEAR_FLAG( RTC_FLAG ) );

    /* Clear the Flags in the RTC_ISR register */
    RTC->ISR = ( uint32_t ) ( ( uint32_t ) ( ~( ( RTC_FLAG | RTC_ISR_INIT ) & 0x0001FFFF ) | ( uint32_t ) ( RTC->ISR & RTC_ISR_INIT ) ) );
}

/**
 * @brief  Checks whether the specified RTC interrupt has occurred or not.
 * @param  RTC_IT: specifies the RTC interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg RTC_IT_TS: Time Stamp interrupt.
 *     @arg RTC_IT_WUT: WakeUp Timer interrupt.
 *     @arg RTC_IT_ALRB: Alarm B interrupt.
 *     @arg RTC_IT_ALRA: Alarm A interrupt.
 *     @arg RTC_IT_TAMP1: Tamper1 event interrupt.
 *     @arg RTC_IT_TAMP2: Tamper2 event interrupt.
 *     @arg RTC_IT_TAMP3: Tamper3 event interrupt.
 * @retval The new state of RTC_IT (SET or RESET).
 */
ITStatus RTC_GetITStatus( uint32_t RTC_IT )
{
    ITStatus bitstatus = RESET;
    uint32_t tmpreg = 0, enablestatus = 0;

    /* Check the parameters */
    assert_param( IS_RTC_GET_IT( RTC_IT ) );

    /* Get the TAMPER Interrupt enable bit and pending bit */
    tmpreg = ( uint32_t ) ( RTC->TAFCR & ( RTC_TAFCR_TAMPIE ) );

    /* Get the Interrupt enable Status */
    enablestatus = ( uint32_t ) ( ( RTC->CR & RTC_IT ) | ( tmpreg & ( ( RTC_IT >> ( RTC_IT >> 18 ) ) >> 15 ) ) );

    /* Get the Interrupt pending bit */
    tmpreg = ( uint32_t ) ( ( RTC->ISR & ( uint32_t ) ( RTC_IT >> 4 ) ) );

    /* Get the status of the Interrupt */
    if( ( enablestatus != ( uint32_t ) RESET ) && ( ( tmpreg & 0x0000FFFF ) != ( uint32_t ) RESET ) )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Clears the RTC's interrupt pending bits.
 * @param  RTC_IT: specifies the RTC interrupt pending bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg RTC_IT_TS: Time Stamp interrupt
 *     @arg RTC_IT_WUT: WakeUp Timer interrupt
 *     @arg RTC_IT_ALRB: Alarm B interrupt
 *     @arg RTC_IT_ALRA: Alarm A interrupt
 *     @arg RTC_IT_TAMP1: Tamper1 event interrupt
 *     @arg RTC_IT_TAMP2: Tamper2 event interrupt
 *     @arg RTC_IT_TAMP3: Tamper3 event interrupt
 * @retval None
 */
void RTC_ClearITPendingBit( uint32_t RTC_IT )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_RTC_CLEAR_IT( RTC_IT ) );

    /* Get the RTC_ISR Interrupt pending bits mask */
    tmpreg = ( uint32_t ) ( RTC_IT >> 4 );

    /* Clear the interrupt pending bits in the RTC_ISR register */
    RTC->ISR = ( uint32_t ) ( ( uint32_t ) ( ~( ( tmpreg | RTC_ISR_INIT ) & 0x0000FFFF ) | ( uint32_t ) ( RTC->ISR & RTC_ISR_INIT ) ) );
}

/**
 * @}
 */

/**
 * @brief  Converts a 2 digit decimal to BCD format.
 * @param  Value: Byte to be converted.
 * @retval Converted byte
 */
static uint8_t RTC_ByteToBcd2( uint8_t Value )
{
    uint8_t bcdhigh = 0;

    while( Value >= 10 )
    {
        bcdhigh++;
        Value -= 10;
    }

    return( ( uint8_t ) ( bcdhigh << 4 ) | Value );
}

/**
 * @brief  Convert from 2 digit BCD to Binary.
 * @param  Value: BCD value to be converted.
 * @retval Converted word
 */
static uint8_t RTC_Bcd2ToByte( uint8_t Value )
{
    uint8_t tmp = 0;

    tmp = ( ( uint8_t ) ( Value & ( uint8_t ) 0xF0 ) >> ( uint8_t ) 0x4 ) * 10;
    return( tmp + ( Value & ( uint8_t ) 0x0F ) );
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
